{
    "recipenuggets": {
        "italian": [
            "February 13th is National “Eat Italian Food” Day",
            "Prosciutto was banned for export to the U.S. until 1989. Mortadella and Speck were outlawed until 2000. Other meats, including cotechino and zampone, are still banned today.",
            "Italians do not put meatballs on spaghetti: the average Italian meal is divided in two parts, primo piatto and secondo piatto.",
            "It was not until the 1700’s until tomato sauce was included with spaghetti in Italian kitchens.",
            "Italian wedding soup is not a traditional soup served at weddings.",
            "The term Neapolitan Ice Cream originated in the U.S. in the late 19th century, and is presumably a reference to the 3 layered ice cream cakes of Tortoni, a Neapolitan.",
            "There are more than 600 pasta shapes produced worldwide.",
            "In the 13th century, the Pope set quality standards for pasta.",
            "The average person in Italy eats more than 51 pounds of pasta every year. The average person in North America eats about 15-1/2 pounds per year.",
            "Most Italians eat pasta at least once a day. But that doesn’t mean they eat the same thing every day! There so many ways to eat pasta, with a variety of different toppings and sauces, that they never get bored.",
            "Each region in Italy has it’s favourite ways to eat pasta. In Rome, two classics are the carbonara (with eggs and pancetta, which is like bacon) and the cacio e pepe (with cheese and pepper)."
        ],
        "mexican": [
            "Some traditional Mexican food recipes call for ingredients such as iguana and rattlesnake!",
            "Mexican food today actually has a rich history – many of Mexico’s more traditional recipes hail from the Aztecs and Mayans.",
            "You can thank Spaniards somewhat for the Mexican food we know today; the traditional Indian foods (inherited from the aforementioned Mayan and Aztec recipes) were changed as the Spanish colonized Mexico, bringing their own cooking ideas, methods and ingredients.",
            "Authentic Mexican food is actually quite healthy: it’s high in vitamins and minerals and low in fat. Many people consider it the perfect blend of the important food groups: meat, dairy, grains, and vegetables.",
            "Traditional Mexican food includes all parts of the cow’s meat: the udder, stomach, tongue, even the uterus and testicles.",
            "TacoTimeCanada.com reports that tortillas once came in cans, and were popular in this form of packaging from the 1940s to about the 1980s.",
            "Every region within Mexico has its own type of Mexican food. Northern Mexican likes its dishes with meat, while Mexico’s southern states prefer chicken and vegetables as the main ingredients. Both regions, however, tend to use the meat as a relish, instead of the main ingredient.",
            "However, the number one ingredient in traditional Mexican food isn’t meat, veggies or chicken: it’s chili.",
            "Even traditional Mexican desserts have chili within them. The chili helps create a nice melding of hot and sweet.",
            "One family in Mexico can consume up to two pounds of tortillas a day."
        ],
        "thai": [
            "Thai cuisine is a perfect blend of flavours – salty, sweet, sour, bitter and spicy. Almost every Thai dish combines all five tastes.",
            "The top ten Thai dishes best liked by people around the world includes Tom Yam Kung, Kaeng Khiao Wan Kai (Green chicken curry) and Pad Thai.",
            "Thai cuisine is so popular around the world that, two Thai dishes – Pad Thai (stir-fried noodles) and Tom Yum Goong (Spicy and Sour Shrimp soup) – are available in every corner of the world.",
            "Thai people never waste rice on the plate, or step on rice because they consider rice as sacred and believe that every grain of rice has a divine element in it.",
            "There is no such a thing is baking in Thailand. None of the food is baked, and most household don’t have an oven.",
            "Eating a meal is generally treated as a celebration therefore it’s quite common to see large groups of individuals eating together. Thai culture treats eating alone as a bad luck gesture hence, all dishes have to be shared and enjoyed together.",
            "Thai cutlery generally consists of a fork and a large spoon (tablespoon). The use of chopsticks arises only when eating noodles.",
            "The formal presentation of food is an important aspect of Thai food culture. It was developed primarily in the palace to please the King of Siam, Thai food presentation is among the most exquisite in the world."
        ],
        "spanish": [
            "Spain with a 44 % of market share is by far the most important producer of olive oil in the world. This is more than twice the Italian production and four times Greek production! ",
            "Spain is the number one in terms of area covered by vineyards. Around 15.5 % of the world vineyards are in Spain!",
            "Around 75 % of the world saffron production is in Spain! Saffron is one of the essential ingredients of the paella dish!",
            "The wine Sherry comes from a city of southern Spain called Jerez, a corruption of the Persian name for the city (Sheriz).",
            "Tortillas in Spain are omelettes! Spanish omelette is commonly known as Spanish tortilla.",
            "Spain is the 5th exporter of wine to the U.S.A.  (after Italy, Australia, France and Chile).",
            "Most famous wines in Spain are red ones, but the majority of the vineyards are of white grapes! ",
            "Tomatoes, potatoes, cacao, tobacco were imported to Europe by Spaniards. See Spanish food influences and history.",
            "Tapas are not a typical dishes or food, tapas are more a way to eat them. The word 'tapa' means cover and Tapas originally were slices of cheese or something else used to cover a drink in order to keep flies and mosquitos away!",
            "Spain is the second country in numbers of bars per inhabitant, just after Cyprus."
        ],
        "indian": [
            "According to Indian food theory, there are six different tastes: sweet, sour, salty, spicy, bitter, and astringent",
            "Love eating samosas? Here’s a shocker for you. It’s not Indian",
            "India consumes 50% of the world’s whiskey",
            "India has the world’s lowest meat consumption per person",
            " 70% of all the world’s spices come from India",
            "The crystallization and making of sugar from sugarcane juice began in India",
            "Did you know that by the 5th century AD, crystallized sugar was referred to as khanda and this is where the word candy is derived from",
            "Chicken tikka masala, the hugely popular Indian curry, is NOT Indian. It was invented in Glasgow, Scotland"
        ],
        "french": [
            "Approximately 500 million snails are consumed per year in France.",
            "The legal drinking age is 18 for liquors containing over 21 percent alcohol but just 16 for most other alcoholic beverages. Many teenagers drink wine with their parents at home, although it is often watered down to begin with. Wine is considered a very important part of the meal and the French are the second biggest consumers of alcohol per capita in the western world after Luxembourg.",
            "McDonalds outlets in France serve beer and you can order a Croque McDuo! The prices are nearly double those in the USA and triple those in Hong Kong but most locals don’t mind as the reason for the price difference is that 90% of all ingredients are sourced locally. Only the best for the French McDonalds!",
            "The French value mealtimes so much that a  two hour lunch break is not uncommon. Outside of the major cities, don’t be surprised if all shops and government buildings are closed between 12pm and 2pm.",
            "A massive ten billion baguettes are baked and sold each year in France and there are strict laws governing their production. To call itself a baguette it must only contain three ingredients – flour, yeast and salt; absolutely no preservatives – and each must weight precisely 250 grams.",
            "The French consume an average of 25 kilograms per person, per year, which makes them the largest consumer of cheese in the world. It is unsurprising therefore that the country produces a huge variety consisting of over 300 different cheeses. Cheese is served as a dish on its own as part of a multi-course meal, after the main course and before the dessert.",
            "An average of two recipe books are published each day in France.",
            "There are over 5,000 restaurants in Paris alone.",
            "Some cheeses made from goats’ milk are covered with charcoal ash before being stored away to mature, which helps to absorb any surface moisture and preserves them for long periods.",
            "French food is extremely varied as each region has its own distinctive cuisine and style, crafted from local produce and determined by the seasons. For example, the Alps region is known for its warming cheese-focused dishes such as fondue and raclette, Provencal food embraces olive oils, fresh tomatoes and wild herbs, and in Normandy the food is rich with butter and creme fraiche, balanced by apples."
        ],
        "chinese": [
            "Did you know that Chinese food has 5 Key Flavors that must be balanced according to Traditional Chinese Medicine — sweet, sour, salty, bitter, and spicy?",
            "The colder, drier north favors wheat production, so northerners eat dumplings, wheat noodles, steamed buns, and stuffed buns mostly. In the south, Chinese eat bowls of rice or rice noodles with almost every meal (as well as far greater varieties of fruit and veg), and only occasionally eat wheat.",
            "Foreigners are often shocked what Chinese eat. Many Chinese dishes make foreigners feel weird or squeamish, like dog hotpot, insects, scorpions, snakes, rats, pig's ears, heads, feet, hearts, lungs, liver, kidneys, intestines, and boiled blood.",
            "Chinese eat far more fruit/vegetables than in the West — about twice as much dietary fiber… resulting in bowel movements twice the size of Western ones!",
            "Crazy variety is not limited to China's \"meats\"… Many of China's vegetables and fruit you won't have seen or heard of before, like pomeloes, bitter cucumber, yard-long yams, tree fungi, and dozens of untranslatable weed-like plants.",
            "Wet markets (where live/freshly-butchered animals and freshly picked foods are sold) abound in China — almost one per city block. Many Chinese go every day. Fridge freezers are catching on, but fresh veg is still a must. Tins are despised.",
            "Also, according to Chinese medicine food must be eaten in season to combat too much yin (cold weather) and yang (hot weather), dryness, or dampness. E.g. huge white radishes (with high yang) are very popular in winter.",
            "Chinese don't like waste, so whole animals are often served. E.g. fish are not filleted, just gutted, with head and bones intact. Sometimes bones are soft enough to chew up; sometimes they must be de-mouthed (onto a side plate).",
            "Chinese believe meat near the bones is the best, and that marrow is very nutritious, so bones are deliberately chopped to splinters to release the marrow — watch out while eating. Bone broth is popular.",
            "Chinese don't eat with knives and forks, traditionally, which is seen as violent or barbaric, but with chopsticks. As chopsticks don't actually chop, all food is very soft or chopped up into bite-size pieces before cooking.",
            "That's an unremarkable average of 2 or 3 pairs of chopsticks used a month for its approaching 1.4 billion population. The government has imposed a disposable chopstick tax to reduce usage. Most (disposable) chopsticks are softwood or bamboo, so that's about 100 square miles or the area of Queens of trees/bamboo… or 50,000 tonnes — imagine trucks of chopsticks lined up end-to-end for 30 miles.",
            "Like Bubba's shrimp in Forest Gump, there are many ways to cook Chinese food. For example, a fish could be steamed, boiled, stewed, quick-fried, stir-fried, deep-fried, roasted, sautéed, marinated in brine, pickled in vinegar, soy-sauced, or sweet-and-sour-sauced.",
            "Chinese chefs, particularly Jiangsu cuisine experts, go overboard on presentation. They believe \"the first bite is with the eyes\". Dishes are served in precise patterns or lifelike shapes, brightened by intricate vegetable carvings and decorative herbs.",
            "Chinese attach particular meanings to certain foods based on shapes, colors, pronunciations, and legends. Superstition and tradition dictate certain foods must be eaten for certain festivals/events to invoke a blessing. For example, ingot-shaped dumplings mean wealth at New Year, and round mooncakes represent family reunion at Mid-Autumn. See The Symbolism of Chinese Foods.",
            "In traditional Chinese meals, dishes are shared communally. Dishes are served in the middle of a table, and people sit with their rice bowls around it. In restaurants, especially for tables seating 10 or 12, there are usually lazy Susan turntables to permit easy sharing among diners. See What Restaurants Are Like in China.",
            "The honored guest is customarily seated furthest from the door with the fish, chicken, duck… heads pointing his way."
        ],
        "english": [
            "It was the Romans who made oysters popular in Britain and were responsible for establishing their cultivation .  The rich waters of Camulodunum (Colchester today) are  ideal for cultivating the delicious Colchester oysters .",
            "In Spring, you can trace the routes of the Roman Army through the south of England by following the white blossom on tall, wild cherry trees. Roman soldiers brought cherries from Italy and spat the pips out as they marched.",
            "The world’s most eaten ‘convenience’ food, the humble sandwich was named after an English aristocrat.   The Earl of Sandwichhad such a passion for gambling, that he didn’t want to have to stop playing – gambling addiction?  To ensure his game was not interrupted and to keep his hands clean for the cards, the Earl of Sandwich asked for meat to be put between two slices of bread.",
            "King James I of England and VI of Scotland imported 10,000 mulberry trees to start a silk industry. Unfortunately, he ordered the wrong variety and the silk worms wouldn’t eat the leaves. The mulberry tree ‘berries,’ however, made excellent jam. ",
            "Bletted’ Medlars were a much loved after dinner treat in Victorian homes in November and December. The fruit was gathered from trees in September, laid in sawdust and kept until the flesh turned dark and soft, as they had to be ‘rotten to be ripe’.  I’ll give this one a miss!",
            "It is not only Stilton cheese that is important to the people of the Heart of England. In 1734, the Mayor of Nottingham was bowled over with a 100 lb. wheel of cheese during a riot after stall-holders at an annual street market had increased cheese prices by more than a third.",
            "The world’s first chocolate bar was made in Bristol in the late 1720s by Joseph Fry. His company was eventually taken over by Cadbury, another British, family owned firm.",
            "Mint sauce became the ‘essential’ accompaniment to roast lamb in Britain thanks to Queen Elizabeth I. To stop her subjects eating lamb and mutton (and help the wool industry), she decreed that the meat could only be served with bitter herbs. Enterprising cooks discovered that mint made the meat taste better, not worse.",
            "Ice cream was so popular in London in the 19th century that massive ‘ice wells’ were dug in the city. Ice was imported from America, and later from Norway to fill them."
        ],
        "american": [
            "Alabama: The official nut of Alabama is the pecan, which explains the popularity of comforting pecan pie in this southern state. It hosts a pecan festival every fall with country music, carnival rides, and a western show.",
            "Alaska: This chilly state is more than frost and snow. Berries can often be foraged out in the nature, and wild Alaskan blueberries are more nutritious than common blueberries.",
            "Arizona: Yuma County, Arizona, is the nation's winter lettuce capital, thanks to its 350 days of sunshine a year. This sunny county provides America with 90% of its leafy greens from November through March and hosts its own veggie festival called \"Yuma Lettuce Days\" every year.",
            "Arkansas: Prefer your veggies on the crispy side? The first fried dill pickle ever sold was at the Duchess Drive-In in Atkins, Arkansas, in 1963. If you're looking to try the original, you can get your fix at the Atkins Picklefest each May.",
            "California: Rolling pastures and bright skies make for happy cows. The Golden State is the United States' #1 dairy producer, churning out tons of butter, milk, and, of course, ice cream each year. Better yet: 99% of California dairy farms are family owned!",
            "Colorado: You've got the Rocky Mountain State to thank for your cookout favorite — thecheeseburger. Drive-in owner Louis E. Ballast trademarked the \"cheeseburger\" on March 5, 1935. He never formally enforced his trademark, and the Humpty Dumpty Barrel restaurant, where the cheeseburger was created, no longer stands, but you can find a stone carving on the side of the road that designates the site of its birth.",
            "Connecticut: This state is for suckers. No, really — the lollypop was first invented in New Haven, Connecticut, in 1908 by George Smith, who enjoyed going to the races so much that he named his creation after a competitor of the time, a horse named Lolly Pop.",
            "Delaware: In 2009, the country's first state declared peach pie its official dessert. The campaign was started by fifth and sixth graders who chose the dessert because of Delaware's peach farming history.",
            "Florida: Guacamole fans, rejoice. The first avocado tree in the United States was planted in Florida in 1833, making taco night in American homes infinitely better since.",
            "Georgia: Your PB&J wouldn't be quite the same without this state. Georgia is the number one peanut producer in the U.S., and half of its crop gets processed into peanut butter — creamy and crunchy.",
            "Hawaii: Need your caffeine fix? Hawaii is the only U.S. state to grow coffee beans. The Kona region of the Big Island is home to 650-700 coffee farms alone and produces 3 million pounds of coffee beans each year.",
            "Idaho: Yes, we want fries with that. While potatoes are grown in all 50 states of the U.S., Idaho remains the country's biggest producer, harvesting about 12 billion pounds annually.",
            "Illinois: Chicago's famous deep-dish pizza isn't an Italian export, but rather an American original. Chicago restaurant Pizza Uno first created the dish in 1943, and it has become the city's most iconic food since.",
            "Indiana: The Hoosier State is one of the country's biggest corn producers, harvesting over 1 billion bushels in 2013. The state takes great pride in its kernel production and even has a town named Popcorn.",
            "Iowa: We have found your new vacation destination, ice cream lovers. Le Mars, Iowa, was deemed the \"Ice Cream Capital of the World\" in 1994, and produces more ice cream from a single company, Blue Bunny, than any other city in the world.",
            "Kansas: This midwestern state harvests so much wheat in a year that its annual harvest could bake 36 billion loaves of bread — enough to feed the world's population for about two weeks.",
            "Kentucky: This state's popular food export is no secret: Colonel Harland Sanders cooked the first batch of Kentucky Fried Chicken at Sanders Cafe in Corbin, Kentucky. The recipe has changed a few times over the years, and the first bucket of KFC chicken sold in 1957.",
            "Louisiana: This state's flavors are so intricate that it has its own cuisine. Cajun food is derived from French-speaking Arcadian immigrants who came to Louisiana in the 18th century. It is known for its aromatic preparation of vegetables, rice, and seafood.",
            "Maine: Get your butter and bibs. Maine's lobster harvest hit an all-time high in 2013, with fishermen bringing in over 100 million pounds of the crustacean. Lobsters are harvested year round in Maine, despite extreme cold winter temperatures.",
            "Maryland: Maine's not the only crustacean capital in the country. Maryland blue crabs are a classic Chesapeake delicacy that locals (and visitors!) enjoy steamed, sautéed, or mixed into soups and dips.",
            "Massachusetts: It wouldn't be New England without a bowl of \"chowdah,\" and Bay Staters take their soup so seriously that rumor has it that it's actually illegal to put tomatoes in New England clam chowder.",
            "Michigan: If you've ever sipped a can of ginger ale to quell an upset stomach, you have this state to thank. The first soda — or \"pop\" — made in the country was Vernor's Ginger Ale in 1866.",
            "Minnesota: Pass the bread basket! This midwestern state is nicknamed the \"Bread and Butter State\" because of its plentiful wheat fields and butter-making plants.",
            "Mississippi: Sweet potatoes have been growing in the United States since before Columbus came over in 1492. Vardaman, Mississippi, is the Sweet Potato Capital of the World and hosts an annual sweet potato festival featuring a pie eating contest, live entertainment, and a Sweet Potato King & Queen competition.",
            "Missouri: The St. Louis World's Fair in 1904 forever changed frozen dessert history when an ice cream vendor ran out of cups and asked a nearby waffle vendor to roll up some waffles, creating the first ice cream cones.",
            "Montana: Vegetables can be pretty sweet. Montana is such a big producer of sugar beets — light brown beets that you can cook to create a molasses — that they're the mascot of Chinook High School.",
            "Nebraska: Got steak? Nebraska's license plates in the 50's and 60's read \"The Beef State\" because beef is the state's single largest industry, boosting the state economy by $12.1 billion.",
            "Nevada: If you're looking to get the biggest meal for your buck, a trip to Las Vegas will leave you with a full belly. The casino city is also known as the world capital of buffets, with about 50 total in the city and approximately 20 on the Strip alone.",
            "New Hampshire: A visit to Stonyfield Farm in Londonderry, New Hampshire, can show you how yogurt and other dairy products are produced ethically. This organic, non-GMO company is the third most popular yogurt producer in the country, and you've probably spotted their products in your dairy aisle. Bonus: They'll even let you taste some free samples.",
            "New Jersey: Need a french fry fix at 2 a.m.? No problem. New Jersey is known as thediner capital of the world thanks to the hundreds of greasy spoons within the Garden States borders. Estimates say there are approximately 525 statewide.",
            "New Mexico: The chile pepper is the state vegetable of the Land of Enchantment. These spicy veggies go great in many New Mexican meals — just be sure not to rub your eyes after handling them.",
            "New York: After a particularly picky customer at Moon's Lake House in Saratoga Springs, New York, complained about the thickness of his french fries in 1853, Chef George Crum sliced some potatoes paper thin, creating the first potato chips.",
            "North Carolina: Pharmacist Caleb Davis Bradham invented Pepsi-Cola in New Bern, North Carolina, in 1867. Although now a beloved soft drink, Pepsi was originally touted as a healthy drink that aided in digestion.",
            "North Dakota: Nearly 90% of this rural state is farmland, making it the nation's leading producer of barley, lentils, canola, and more.",
            "Ohio: Internationally recognized horticulturalist Alexander W. Livingston developed the Paragon tomato, the first commercially grown tomato, in 1870 in Reynoldsburg, Ohio, giving the town the title, \"Birthplace of the Tomato.\"",
            "Oklahoma: While it's considered a fruit pretty much everywhere else, the watermelon was declared the state vegetable of Oklahoma in 2007. Since watermelons come from cucumber and gourd families, the state decided that they should be considered vegetables.",
            "Oregon: 99% of all hazelnuts in the U.S. are grown in Oregon's Willamette Valley, keeping the country's chocolate-hazelnut cravings completely satisfied.",
            "Pennsylvania: The Philly Cheesesteak made its debut in 1930 when Pat Olivieri, a hot dog vendor, decided to put some beef on his grill and put it on a sandwich. Eventually Pat's King of Steaks opened and the cheesesteak's popularity skyrocketed.",
            "Rhode Island: A cup of Joe isn't necessary to get your java fix in this state. Rhode Island adopted coffee milk as its state beverage in 1993. Similar to chocolate milk, the drink is made by mixing a sweet, concentrated coffee syrup with cold milk.",
            "South Carolina: The first recorded effort to cultivate rice in the U.S. happened in Charleston, South Carolina, in 1685. Because of this historical connection to the grain, the state is sometimes called \"The Rice State.\"",
            "South Dakota: This state has maintained its culinary connection to native culture. Fry bread — the official state bread — has its origins in the Navajo tribe.",
            "Tennessee: Originally developed as a snack sold to Appalachian coal miners, moon pieswere first made in Chattanooga Bakery in Tennessee. The cookies are made with a marshmallow sandwiched between two graham crackers, dipped in chocolate.",
            "Texas: This north-of-the-border state produces 1/3 of all the tortillas in the United States— they are a Tex-Mex staple, after all.",
            "Utah: Approximately 2 billion cherries are grown in Utah annually, making it the official state fruit. After World War II, the Japanese also sent cherry trees to Utah as a sign of friendship.",
            "Vermont: The state capital, Montpelier, is the single largest producer of maple syrup in the U.S. In 2013 alone, the syrup crop came in at 1,320,000 gallons, the largest in 70 years.",
            "Virginia: This seaside state is known as the oyster capital of the east coast, thanks to its plentiful seafood yields. The world's only oyster museum is also located in Chincoteague Island, Virginia.",
            "Washington: If every apple picked in Washington in a single year was placed side-by-side, they would circle around the earth 29 times. Even more impressive? Every apple in the state is hand-picked.",
            "West Virginia: The calzone-esque pepperoni roll originated as a meal for West Virginian coal minors. They are made out of bread rolls with pepperoni and sometimes cheese baked into the middle.",
            "Wisconsin: Home of the cheeseheads, Wisconsin produces more than 600 different varieties of cheese. Today the state is home to 11,000 dairy farms and more than 1.27 million cows.",
            "Wyoming: Harkening back to its cowboy roots, Wyoming has its own type of feast: a milk can dinner. Vegetables, meat, and water or beer are placed in a 10-gallon milk can and then cooked over a fire for a couple hours."
        ],
        "general fun facts": [
            "A survey showed 29% of adults say they have been splashed or scalded by hot drinks while dunking biscuits.",
            "Ortharexia Nervosa is an eating disorder where the sufferer is obsessed with eating healthy food.",
            "Ketchup was sold in the 1830’s as medicine.",
            "Dry swallowing one teaspoon of sugar can commonly cure hic-ups.",
            "In Kentucky, it is illegal to carry an ice cream cone in your back pocket.",
            "The fear of cooking is known as Mageirocophobia and is a recognised phobia.",
            "The tea bag was introduced in 1908 by Thomas Sullivan of New York.",
            "The tall chef’s hat is called a toque.",
            "Arachibutyrophobia is the fear of peanut butter sticking to the roof of the mouth.",
            "In South Africa, termites and ants are often roasted and eaten by the handful, like popcorn.",
            "Every time you lick a stamp, you consume 1/10 of a calorie.",
            "Pearls melt in vinegar.",
            "The ’57’ on the Heinz ketchup bottle represents the number of pickle types the company once had.",
            "Marmite was first introduced into the UK in 1902.",
            "The ancient Greeks chewed a gum-like substance called mastic that came from the bark of a tree.",
            "Honeybee workers must visit 2 million flowers to make one pound of honey.",
            "The fear of vegetables is called Lachanophobia.",
            "Almonds are a member of the peach family.",
            "If you boil beetroot in water, and then massage the water into your scalp each night, it works as an effective cure for dandruff.",
            "In the United States, lettuce is the second most popular fresh vegetable.",
            "Grape growing is the largest food industry in the world as there are more than 60 species and 8000 varieties of grapes.",
            "The average person eats eight pounds of grapes each year.",
            "There are more than 7,000 varieties of apples grown in the world.",
            "A cluster of bananas id formerly called a ‘hand’. Along that theme, a single banana is called a ‘finger’.",
            "Onion is Latin for ‘large pearl’.",
            "Apples, pears, cherries and strawberries are all members of the rose family.",
            "The word vegetable has no scientific definition, so it’s still acceptable to call a tomato a vegetable.",
            "In the Philippines, it is considered good luck if a coconut is cleanly split open without jagged edges.",
            "When cranberries are ripe, they bounce like a rubber ball.",
            "The most amount of grapes eaten in 3 minutes is 133. This record was set in 2001 by Mat Hand, from the UK.",
            "There are more than 10,000 varieties of tomatoes.",
            "In 2001, there were more than 300 banana-related accidents in Britain, most involving people slipping on skins.",
            "If you want to speed up the ripening of a pineapple, so that you can eat it faster, then you can do it by standing it upside down (on the leafy end).",
            "Carrots have zero fat content.",
            "Peanuts can be used to make dynamite.",
            "A watermelon is over 92% water by weight.",
            "Alliumphobia is the fear of garlic.",
            "A row of corn always has an even number.",
            "The pumpkin originated in Mexico about 9,000 years ago.",
            "Square watermelons sell for about $85.",
            "Turnips are high in fibre, Vitamin C, Calcium and Potassium.",
            "Eating a lot of beetroot turns your pee into a pink colour.",
            "Biting a wooden spoon whilst chopping an onion will stop your eyes from watering.",
            "Each pineapple plant only produces just one pineapple per year.",
            "Lettuce is a member of the sunflower family.",
            "Blueberries are a good source of Vitamin C and fibre.",
            "Pumpkin flowers are edible.",
            "Peaches are the third most popular fruit grown in America.",
            "We are eating 900% more broccoli than we did 20 years ago.",
            "There are more than 600 pasta shapes produced worldwide.",
            "Geomelophagia is someone who has the urge to eat raw potatoes.",
            "9th August is officially National Rice Pudding Day.",
            "Rice can be used in beer, dog food, baby food, breakfast cereals, snacks, frozen foods and sauces!",
            "October is National Pasta Month.",
            "Canadian neurosurgeon Dr. Wilder Penfield, while operating on epilepsy patients, discovered the ‘Toast Centre’ of the human brain, which is wholly dedicated to detecting when toast is burning!",
            "16 billion jelly beans are made for Easter. stacked end to end, the jelly beans would circle the globe nearly 3 times!",
            "Before 1991 Twix Bars were internationally knows as ‘Raider’.",
            "5The Arabs invented caramel.",
            "Before Walkers owned Wotsits, they sold a rival known as Cheetos on the UK market.",
            "Pringles were first sold in America in 1968 but were not popular until the mid 1970’s.",
            "Saddam Hussein liked Bounty Bars!",
            "Frank Mars invented the Snickers chocolate bar. He named it Snickers after his favourite horse.",
            "The M’s in M & M’s stand for ‘Mars & Murrie’, the co-creators of the candy.",
            "Twinkies originally had banana flavoured filling, but switched to vanilla when World War 2 bought the banana trade to a halt.",
            "Cadbury’s Cream Eggs first went on sale in 1971.",
            "In 2006, Shari’s Berries pioneered the concept of delivering chocolate dipped fruits nationwide in freeze packs.",
            "The Kit Kat was originally made by Rowntree Limited, until 1988 when they were bought out by Nestle.",
            "Juicy Fruit and Wrigley’s Spearmint gums are more than 100 years old!",
            "Hundreds and Thousands (Sprinkles, Nonpareils, Jimmies) are small round balls of brightly coloured sugar used as decorations on cakes, cookies, trifles and other desserts. Their use dates back at least to the early 19th century.",
            "Gummy Bears are only 79 millimetres long in length.",
            "Chocolate can kill dogs; it directly affects their heart and nervous system.",
            "Deep fried chocolate bars contain about 850 calories per bar.",
            "The world’s oldest chocolates are 106 years old. A tin of chocolates from the coronation of King Edward VII from 1902.",
            "Yorkie Chocolate Bars are not for girls!",
            "Sugar is the only taste that humans are born craving.",
            "The Swiss eat the most chocolate, followed by the English.",
            "The Bourbon biscuit was introduced in 1910 originally under the name Creola.",
            "In 15th century France, chocolate could only be eaten by members of the royal court.",
            "Gorgonzola cheese dates back to the year 879!",
            "Many mass-produced ice creams have seaweed in them.",
            "Cheese products contain less than 51% cheese.",
            "Some yoghurt contain beef or pork gelatin.",
            "The weight of a Babybel is 21 grammes.",
            "An average American will eat the equivalent of 28 pigs in their life.",
            "National Pigs-in-a-Blanket Day is celebrated on 24th April every year.",
            "The first soup was made from hippopotamus and dates back to 6000 B.C.",
            "Baked beans are low in fat and have a lot of fibre and protein.",
            "Worcestershire sauce is made from dissolved fish.",
            "Pescetarians are vegetarians who eat fish.",
            "The largest item on any menu in the world is the roast camel.",
            "Egg yolks are one of the few foods that naturally contain Vitamin D.",
            "The average hot dog is consumed in 6 bites.",
            "Until well into the sixteenth century, bacon was a Middle English term used to refer to all pork in general.",
            "In America, anchovies always rank last on the list of favourite toppings.",
            "The world average of the amount of meat eaten per year is: 173 lbs per person.",
            "French fries came from Belgium, but are most popular in the US.",
            "An average person will consume 12 pubic hairs in their fast food every year!",
            "KFC (Kentucky Fried Chicken) was founded by Colonel Harland Sanders in 1952.",
            "We eat 300 million portions of fish and chips in Britain each year.",
            "Chicken McNuggets contain beef additives."
        ]
    }
}